Repository: 84000/data-translation-memory
Catalog: toh579-v4.tmx
Source language: bo
Languages: en

source: ༄༅། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་སྙིང་པོའི་གཟུངས།
en: The Dhāraṇī of the Essence of the Six Perfections

source: འཕགས་པ་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Noble Mother, Prajñāpāramitā.

source: སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Buddha.

source: ཆོས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Dharma.

source: དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Saṅgha.

source: ན་མོ་དྷརྨ་ཀཱ་ཡ། སཾ་བྷོ་ག་ཀཱ་ཡ། ནིརྨཱ་ཎ་ཀཱ་ཡ། ཏདྱ་ཐཱ། དཱ་ན་པཱ་ར་མི་ཏཱ། ཤཱི་ལ་པཱ་ར་མི་ཏཱ། ཀྵཱནྟི་པཱ་ར་མི་ཏཱ། བཱིརྱ་པཱ་ར་མི་ཏཱ། དྷྱཱ་ན་པཱ་ར་མི་ཏཱ། པྲཛྙཱ་པཱ་ར་མི་ཏཱ། སརྦ་དྷརྨ་ཤཱུ་ནྱ་ཏཱ་སྭཱ་ཧཱ།
en: namo dharmakāya saṃbhogakāya nirmāṇakāya | tadyathā | dānapāramitā śīlapāramitā kṣāntipāramitā vīryapāramitā dhyānapāramitā prajñāpāramitā sarvadharmaśunyatā svāhā |

source: འདི་བཟུང་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གཟུང་བར་འགྱུར་རོ། །སྟོང་པ་ཉིད་ཡིད་ལ་བྱས་པར་འགྱུར་རོ། །
en: By taking this up, one will retain the six perfections, and emptiness will have been established in one’s mind.

source: རྟག་ཏུ་བཟླས་བརྗོད་བྱས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མདོ་དང་རྒྱས་པ་ཤེས་པར་འགྱུར་རོ། །མཚམས་མེད་པ་ལྔ་བྱང་བར་འགྱུར་རོ། །ལྟས་ངན་པ་ཐམས་ཅད་ཀྱང་མི་སྡིག་གོ། །
en: When one verbally recites this constantly, one will understand all the aphoristic and extensive teachings, one will purify the five deeds of immediate retribution, and one will also overcome all bad views.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་སྙིང་པོའི་གཟུངས་རྫོགས་སོ།​།
en: This completes “The Dhāraṇī of the Essence of the Six Perfections.”
